
// 202310150247K **************







// all故只轉這 **********
// 圖號0開始

let 故名 = 'samchan的故事'

let 故文 = [
    '當samchan回想起自己年輕時的英雄故事，他心中充滿了回憶和感慨。<br><br>\
    那是很久很久以前的事了，他那時正值青春年華，充滿著無限的熱情和勇氣。<br><br>',

    '年輕時的samchan住在同樣的小村莊裡，是一位農夫。<br><br>\
    雖然生活條件艱苦，但他總是樂觀向上，積極面對生活的挑戰。<br><br>',

    '有一年，村莊遭受了一場嚴重的洪水。<br><br>\
    水位不斷上升，村民們陷入了恐慌和絕望之中。<br><br>\
    然而，年輕的 samchan並沒有被困境所打敗，相反，他挺身而出，帶領著村民們展開了一場艱苦的抗洪救援行動。<br><br>',

    'samchan和村民們一起建立了臨時的防洪堤，用土石和沙袋堆砌而成。<br><br>\
    他們努力工作，不分昼夜地奮戰，為了保護家園，為了拯救村莊的人們。<br><br>\
    samcha帶領著大家，不僅分配工作任務，還鼓勵他們堅持下去，相信自己的力量。<br><br>',

    '在這場抗洪救援行動中， samchan展現了非凡的領導才能和堅韌的意志。<br><br>\
    他不僅帶領村民們成功地建立了防洪堤，還組織了疏散和救援行動，保護了村莊裡的每一個人。<br><br>\
    最終，洪水退去，村莊得以倖免於災 samchan成為了村莊的英雄，他的事蹟被傳頌了很多年。<br><br>',

    '年輕時的英雄故事 samchan體會到了無私奉獻的價值。<br><br>\
    他明白，只要我們願意伸出援手，無論年齡或身份，都有機會成為英雄。<br><br>',

    '這個故事也成為他人生中的寶貴財富，讓他明白到真正的豐富不是來自於物質財富，而是來自於對他人的關愛和幫助。<br><br>\
    他從此開始關注社區和社會的發展，積極參與公益活動，為社會做出自己的貢獻。<br><br>\
    samchan的英雄故事也成為了年輕人的榜樣和啟示。<br><br>\
    他們學習samchan的精神，懂得了奉獻和助人的重要性，並且將這種精神傳承下去。<br><br>',
]

























// 讓網頁一開始就執行js 
// https://www.zymseo.com/big5/program_250447 
// <body id="body" onLoad="指定故事()">

function 指定故事轉runAKIjsFun() {    _指定故事()}